app/views/books/_books.html.erb

UPDATE "books" SET "situation_id" = ?, "updated_at" = ? WHERE "books"."id" = 19  [["situation_id", 2], ["updated_at", "2015-12-06 22:40:31.569374"]]
---
        <td><%= book.situation_id = 1 %></td>
        <td><%= book.save %></td>