app/controllers/books_controller.rb

SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "books" SET "situation_id" = ?, "updated_at" = ? WHERE "books"."id" = 3  [["situation_id", 2], ["updated_at", "2015-12-07 10:22:55.705255"]]
---
  def reserve_it
    @ref_book = params[:ref_book]
    @book = Book.find(@ref_book)
    @book.situation_id = 2
    @book.save

SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "books" SET "situation_id" = ?, "updated_at" = ? WHERE "books"."id" = 3  [["situation_id", 1], ["updated_at", "2015-12-07 10:19:38.538724"]]
---
  def render_it
    @ref_book = params[:ref_book]
    @book = Book.find(@ref_book)
    @book.situation_id = 1
    @book.save

INSERT INTO "books" ("author", "created_at", "note", "synopsis", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Auteur"], ["created_at", "2015-11-24 09:48:51.889248"], ["note", 100], ["synopsis", "Il était une fois"], ["title", "Titre"], ["updated_at", "2015-11-24 09:48:51.889248"]]
---
  def create
    @book = Book.create(book_params)

UPDATE "books" SET "cover_file_name" = ?, "cover_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = 18  [["cover_file_name", "Capture_du_2015-11-30_10_51_12.png"], ["cover_updated_at", "2015-12-01 14:53:49.371740"], ["updated_at", "2015-12-01 14:53:49.712587"]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)