app/controllers/comments_controller.rb

	def create
		@book = Book.find(params[:book_id])
		@comment = @book.comments.new(comment_params)
		if @comment.save
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("book_id", "created_at", "message", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["book_id", 3], ["created_at", "2015-12-01 20:03:47.932881"], ["message", "Excellent livre"], ["updated_at", "2015-12-01 20:03:47.932881"], ["user_name", "Pierre"]]